import { Footer } from '../organisms/Footer/Footer';
import { Header } from '../organisms/Header/Header';

export const AppRouter = () => (
  <div>
    {/*------------------------------------------*/}
    <header>
      {/*хідер яку треба доробити з ссилками на сторінки і кнопки добавити змінні від стейту* */}
      <Header />
      <aside>{/*наша компонента бургер меню */}</aside>
    </header>
    {/*------------------------------------------*/}
    <main>
      {/*мейн контент ще в опрацюванні* */}
      <div>
        {/*для зручності відділити від хідера і футера* */}
        {/*------------------------------------------*/}
        {/*------------------------------------------*/}
        <section>
          {/*перша частина Секція з слаййдером */}
          <section>
            <h1>Welcome to Nice Gadgets store!</h1>
            <div>
              {/*контейнер з 2 кнопками по боках + ссилка посередині на картинку і 3 кнопки? слайдера які зараз показує */}
              <div>
                <button></button> {/*ліва кнопка*/}
                <img></img>
                <button></button> {/*права кнопка */}
              </div>
              <div>
                <button></button> {/*ліва кнопка яка залежить від слайдеру*/}
                <button></button>{' '}
                {/*центральна кнопка яка залежить від слайдеру*/}
                <button></button> {/*права кнопка яка залежить від слайдеру*/}
              </div>
            </div>
          </section>
        </section>
        {/*------------------------------------------*/}
        {/*------------------------------------------*/}
        <section>
          {/*друга частина Секція з 3 картами телефонів 2 2ма кнопками */}
          <section>
            <div>
              <h2>Brand new models</h2>
              <div>
                <button></button>
                {/*Кнопка лайд вліво*/}
                <button></button>
                {/*Кнопка лайд вправо*/}
              </div>
            </div>
            <div>
              {/*Контейнер грід сєтки по 3 картки*/}
              <div>{/*3 картки які показуються*/}</div>
            </div>
          </section>
        </section>
        {/*------------------------------------------*/}
        {/*------------------------------------------*/}
        <section>
          {/*третя частина Секція з 3 hspybvb папками/ видами товарів */}
          <section>
            <h3>Shop by category</h3>

            <div>
              {/*сітка грід для категорій */}
              <div>
                <a>{/*Категорія телефонів */}</a>
                <p>124 models</p>
                {/*якийсь калькулятор скільки там речей в категорії*/}
              </div>
              <div>
                <a>{/*Категорія планшетів */}</a>
                <p>124 models</p>
                {/*якийсь калькулятор скільки там речей в категорії*/}
              </div>
              <div>
                <a>{/*Категорія все інше */}</a>
                <p>124 models</p>
                {/*якийсь калькулятор скільки там речей в категорії*/}
              </div>
            </div>
          </section>
        </section>
        {/*------------------------------------------*/}
        {/*------------------------------------------*/}
        <section>
          {/*четверта частина Секція з 3 картами телефонів 2 2ма кнопками З СКИДКАМИ*/}
          <section>
            <div>
              <h2>Hot prices</h2>
              <div>
                <button></button>
                {/*Кнопка лайд вліво*/}
                <button></button>
                {/*Кнопка лайд вправо*/}
              </div>
            </div>
            <div>
              {/*Контейнер грід сєтки по 3 картки*/}
              <div>{/*3 картки які показуються*/}</div>
            </div>
          </section>
        </section>
      </div>
    </main>
    {/*------------------------------------------*/}
    {/*------------------------------------------*/}
    <Footer>{/*Футер який треба доробити з ссилками на сторінки* */}</Footer>
    {/*------------------------------------------*/}
    {/*------------------------------------------*/}
    {/*А ще треба зробити окремі сторінки 3 однакові Каталоги Телефону/Планшету/Всього іншого !*/}
    <section>
      <div>
        <a></a>
        {/*ССилка з картинки на дім*/}
        <img></img> {/*стрілка*/}
        <span></span> {/*Hана категорія*/}
      </div>
      <div>
        <h1>Mobile phones</h1>
      </div>
      <div>
        <p>124 models</p>
        {/*якийсь калькулятор скільки там речей в категорії*/}
      </div>
      <div>
        {/* чисто блок сортування*/}
        <div></div>
        {/*Сортування по новизні*/}
        <div></div>
        {/*Сортування по кількості речей на сторінці*/}
      </div>
      <section>
        {/* наща сторінка з телефонами*/}
        <div>{/*карточки на сторінці*/}</div>
        <div>
          {/*Кнопки сторінок в залежності скільки ми вибрали в фільтрі*/}
        </div>
      </section>
    </section>
    {/*------------------------------------------*/}
    {/*------------------------------------------*/}
    <section>
      {/*favorites*/}
      <div>
        <a></a>
        {/*ССилка з картинки на дім*/}
        <img></img> {/*стрілка*/}
        <span></span> {/*Hана категорія*/}
      </div>
      <div>
        <h1>Favourites</h1>
        <p>0 items</p> {/*Думаю або пусто або те що було вибрано*/}
      </div>
      <p>Your favourites is empty</p>{' '}
      {/*Думаю або пусто або те що було вибрано*/}
    </section>
    {/*------------------------------------------*/}
    {/*------------------------------------------*/}
    <section>
      {/*Card shop*/}
      <button>
        <img></img> {/*Стрілочка*/}
        <p></p> {/*back*/}
      </button>
      <h1>Card</h1>
      <div>
        {/*рендер або пусто або вибір*/}
        <div>
          <p>Your cart is empty</p>
          {/*Або нічого не показуємо і типу якусь картинку павутинки*/}
          <img>Empty</img>
        </div>
        <div>
          <div></div>
          {/*Або тут наші товари які вибрали*/}
        </div>
      </div>
    </section>
  </div>
);
