export const HomeLayout = () => (
  <>
    <header>
      {/*хідер яку треба доробити з ссилками на сторінки і кнопки добавити змінні від стейту* */}
      <aside>{/*наша компонента бургер меню */}</aside>
    </header>

    <main>
      {/*мейн контент ще в опрацюванні* */}
      <div>
        <section>{/*перша частина Секція з слаййдером */}</section>

        <section>
          {/*друга частина Секція з 3 картами телефонів 2 2ма кнопками */}
          <section>
            <div>
              <h2>Brand new models</h2>
              <div>
                <button></button>
                {/*Кнопка лайд вліво*/}
                <button></button>
                {/*Кнопка лайд вправо*/}
              </div>
            </div>
            <div>
              {/*Контейнер слайдер сєтки по 1,5-4 картки*/}
              <div></div>
            </div>
          </section>
        </section>
        {/*------------------------------------------*/}
        {/*------------------------------------------*/}
        <section>
          {/*третя частина Секція з 3 hspybvb папками/ видами товарів */}
          <section>
            <h3>Shop by category</h3>
            <div>
              {/*сітка грід для категорій */}
              <div>
                <a>{/*Категорія телефонів */}</a>
                <p>124 models</p>
                {/*якийсь калькулятор скільки там речей в категорії*/}
              </div>
              <div>
                <a>{/*Категорія планшетів */}</a>
                <p>124 models</p>
                {/*якийсь калькулятор скільки там речей в категорії*/}
              </div>
              <div>
                <a>{/*Категорія все інше */}</a>
                <p>124 models</p>
                {/*якийсь калькулятор скільки там речей в категорії*/}
              </div>
            </div>
          </section>
        </section>
        {/*------------------------------------------*/}
        {/*------------------------------------------*/}
        <section>
          {/*четверта частина Секція з 3 картами телефонів 2 2ма кнопками З СКИДКАМИ*/}
          <section>
            <div>
              <h2>Hot prices</h2>
              <div>
                <button></button>
                {/*Кнопка лайд вліво*/}
                <button></button>
                {/*Кнопка лайд вправо*/}
              </div>
            </div>
            <div>
              {/*Контейнер слайдер сєтки по 1,5-4 картки*/}
              <div></div>
            </div>
          </section>
        </section>
      </div>
    </main>
    <footer></footer>
  </>
);
